const question=
[
    'を創り出す、を引き起こす','増加する、を増やす','を向上させる、よくなる','を意味する、（...する）つもりである（to do）','を所有している、（事実・罪など）を認める','を含む','を見なす、について考える','を許す、を与える、（～を）考慮に入れる（for）','を提案する、を暗示する','を生産する、を取り出す','を決める、に決着をつける','を提供する,申し出る','を要求する、を必要とする','を共有する、を分担する','を保存する、を蓄える','傾向がある、を世話する','〔受身形で〕心配している、〔受身形で〕（～に）関係する（with）、に関連する','について述べる,を説明する','を関与させる、を伴う','を減らす、を（～に）変える（to）','を設計する、を計画する','に強いる、を強要する','を制限［規制］する','に耐える、を負う、を産む、を（心に）抱く','に影響を及ぼす、を感動させる','を処理する、を商う、を分配する','を避ける','を関連づける、（～に）関連する（to）','に気づく、を実現する','を奨励する、を励ます','を比較する、を（～に）たとえる（to）','を測る、を（比較して）評価する','存在する、生存する','に印をつける、を（記号で）示す、に汚れをつける','に異議を唱える、（人）に挑む','頼る、～次第である','反対する、（...）と言って反対する（that節）','を要求する','を設立する、（理論など）を（～に基づいて）築く（on）','を完成させる,仕上げる','考え,思いつき、理解、見解、概念','一致、合意,協定','会社、〔集合的に〕仲間、（仲間と）一緒にいること、一座','興味、利子、利害','（～についての）研究,調査（into / on / in）','原因、理由、大義','理由、（...する）根拠（to do）、理性、分別','影響,効果、結果','影響（力）','状況、（人の置かれた）立場','環境','技能、熟練','事柄、問題、〔～s〕事態、〔the ～〕困難、物質','（～についての）見解（on / about）、（～に対する）（特定の）見方（of）、眺め','価値、価格、評価、〔～s〕価値観','（生物の）種、種類','考え、思考','知識、知っていること、認識','記憶（力）、（～の）思い出（of）','実践,実行、（社会の）慣習、練習','利益,恩恵、給付金','学説、理論、原理、推測','問題（点）、発行（物）、発表','（～を対象とする）実験（on）','記事、条項、品物','焦点、関心の的','話題、科目、主題、被験者','計画、事業、研究計画','質、特質','役割、（俳優などの）役','（専門）用語、〔～s〕条件、〔～s〕間柄、学期','声明、主張、明細書','材料,素材、資料、生地','証拠','（～の）源,根源（of）、出所,情報源','（共同）社会,～界、地域社会、地域住民','科学技術、応用技術','文化、教養、耕作、養殖、培養','（～に）適切な（for / to）','ありそうな','可能な、可能性のある','個々の、個人の','公の、公衆の、公開の','共通の、普通の、一般の','確信して、確かな、ある、一定の','似ている,類似した、同様の','最近の','主要な、大きい（ほうの）、長調の','忍耐強い、勤勉な','特定の、特別の、（～について）やかましい（about）','身体の、物質的な、物理学の','さまざまな、いくつかの','手に入る、利用できる、手が空いている','出生地の、原産の、生得の','政治（上）の','予定された、（支払）期日で、しかるべき','空白の、無表情な、がらんとした','古代の、昔からの','正しい、適切な','～にもかかわらず','に気づく','言及する,関連する、参照する','に近づく、に取り組む','かなと思う、（に）驚く（at）','（を）想像する、（を）推測する','を識別できる、を認める','を解く,解明する、（困難など）を解決する','起こる、心に浮かぶ、現れる','と主張する、議論する','と主張する、を（自分のものとして）要求する','を表す,述べる','を引き出す、を引く、を描く、近づく','を浪費する,無駄にする','を進歩させる、を進める、進歩する、進む','を広める、広がる','を準備する、を調理する、（～のために）準備をする（for）','を獲得する、（を）増す','を達成する、を成し遂げる','を確立する、を設立する','を供給する','と思う、と仮定する','（を）行う、（を）演じる,（を）演奏する','のほうを好む','を決定する、を正確に知る','を扱う、を治療する','を証明する、判明する,わかる','を適用［応用］する、申し込む、（～に）適用される（to / in）','に言及する、と言う','（～と）情報交換をする（with）、を伝達する','を含む、を収容する、（感情など）を抑える','と連絡を取る、接触する','を見なす、を見る、を評価する','を尊敬する、を尊重する','捜す、を捜索する、を詳しく調べる','をつなぐ、を関連づける','減少する、衰退する、を断る','を妨げる、を防ぐ','苦しむ、患う、（苦痛など）を経験する','を切り抜けて生き残る、より長生きする、生き延びる','を出版する、を公表する','機会','（課せられた）仕事,作業、課題、タスク','産業、勤勉','（情報伝達の）媒体、手段','経済（状態）、経済圏、節約','政策,方針、（個人の）主義','説明、勘定、口座','貿易、商売,取引','模範、モデル、模型、型','数字、姿、人物、図表','細胞、独房、電池','印象,イメージ、画像、像','感情,情動、感動','ストレス、圧力、強調','10年間','範囲、射程距離、（同類の）組','性格,個性、特徴、登場人物、文字','利点、優勢、有利','句、成句、言葉遣い','損害,損傷、〔～s〕損害賠償金','影響、（激しい）衝突、衝撃（力）','方法、体系、秩序','〔通例～s〕資源、〔通例～s〕資金、才覚','地域、領域、部位','薬、医学','〔～s〕詳細（な情報）,細部','特徴、〔通例～s〕顔つき、特集記事［番組］','機能、関数','利用,入手、接近（の機会・方法・権利）','品目,項目、（同種の中の）～個、（短い）記事','収入、所得','態度、考え方,心構え','用地,場所、跡地、（ウェブ）サイト','（物事の）側面、観点、様相','構造、体系、構造物','習慣,癖','関連,つながり、（2地点を結ぶ）交通手段、リンク','（具体的な）例,実例、（特定の）場合','肯定的な、積極的な、確信して、（検査結果が）陽性の','否定的な、消極的な、（検査結果が）陰性の','複雑な、複合（体）の','現在の、現代の、通用している','精神の、知能の、頭の中で行う','特定の、明確な,具体的な、（～に）特有の（to）','重要な,重大な、意義深い','（～に）必要不可欠な（to / for）、本質的な','公用の、公式の、役所の','財政（上）の、財界の','学問の、大学の','気づいて,知って','（...する）に値する（doing）、の価値がある','潜在的な、可能性を秘めた','積極的な、活動的な、効力のある','デジタル方式の、デジタル［数字］表示の','可動［移動］式の、流動性のある','斬新な,目新しい','柔軟な、プラスチックの,ビニールの','化学の,化学的な','必要な','結局（は）','を特定する、を（～と）同一視する（with）','を表す、を代表する、に相当する','を指し示す、を述べる','をなんとか成し遂げる、を管理する','に出席する、（を）世話する、（～に）対処［対応］する（to）','を維持する、と主張する、を養う','を調査する、をじろじろ見る、を概観する','に取って代わる、を取り替える','を（～に）分類する（into）、を（～から）えり分ける（from）','（調査・実験など）を実施する、を導く','を結び付けて考える、（～と）交際する（with）','を試みる,企てる','を促進する、〔通例受身形で〕昇進する','を稼ぐ、を得る、をもたらす','を団結させる、（を）結合する、団結する','に食べ物［乳］を与える、に（～を）供給［補給］する（with）、餌を食べる','を追い求める、（助けなど）を要請する','に気づく、を観察する、を遵守する','を明らかにする、を見せる','と推定する、を見積もる、を評価する','を反映する、（を）反射する、（を）熟考する','を引きつける','減少する、を減らす','を無視する','（と）合う、に匹敵する、一致する','を定義する、を明確にする','適応する、を（～に）適合させる（to）','貢献する,一因となる、（を）寄付する、（を）寄稿する','（を）交換する、両替する','を示す、を発揮する、を展示［陳列］する','反応する、答える','を隠す、隠れる','ではないと思う、を疑う','を取り除く、を解雇する','（ねじなど）を巻く、（道などが）曲がりくねる、巻きつく','を当然のことと思う,と仮定する、（権力など）を手に入れる、（責任など）を引き受ける','くつろぐ、緩む、をくつろがせる、を緩める','を満足させる、（条件など）を満たす','を強く望む','（～に）成功する（in）、（～を）継承する（to）','概念、考え、（商品・販売の）コンセプト','流行,ファッション、方法,流儀','装置,機器、方策、デバイス','料金、世話、管理、告発','（～との）対照（with / to）','（職場の）同僚','苦痛,痛み、苦悩、〔～s〕骨折り','請求書、勘定書、法案','内容,中身、コンテンツ','部門、部分、地区、欄','〔集合的に〕聴衆,観客、視聴者','表面、〔the ～〕外見','〔しばしば～s〕作物、収穫高','話題,トピック、主題','技術、技巧、手法','地位、状態','選択（の自由）、選択肢','報酬、報い','人種、民族、競争','罪,犯罪、違法行為','争い、論争、不一致','闘い、懸命の努力','状況,背景、文脈','討論,論争、討論会','燃料、勢いを増加させるもの','汚染,公害','（～への）傾向（toward）、流行','均衡,バランス、（体の）平衡、残高','交通、通行、交通［輸送］量、（不正）取引','戦略','基礎、根拠、基準','〔通例～s〕結果、重大性','目的,目標、狙い','祖先、原型','遺伝子','跡、軌道、【米】（鉄道の）番線、走路','革命、回転、（天体の）公転','進歩、前進','認知の','理想的な、観念的な','効率的な、有能な','普遍的な、宇宙の、万能の','莫大な、広大な','追加の,余分の、別勘定の','全体の,全部の、完全な','精通している、よく知られている','明らかな','道徳（上）の,倫理的な、道徳的な','一般の,普通の、並の','（～に）等しい（to）、匹敵する、平等な','以前の,前の','間違った、虚偽の、偽の','まれな,珍しい、希少な','法律の、合法の','（～から）独立した（of / from）','極端な、極度の,過激な','実際の,現実の','いとわない,かまわないと思う','都市の、都会的な','～するのに（対し）,～する一方','を予言［予測］する','を調べる、を診察する、を尋問する','を信頼する、を（信頼して）託す','を動けなくする、を突き刺す、（～に）くっつく（to / on）','現れる、明らかになる、台頭する','さまざまである、変わる、を変える','を放出する、を解放する、を発表する','を分ける、分かれる','（人）が...できるようにする、を可能にする','（を）判断する、に判決を下す','頼る','を従事させる、を（～として）雇う（as）、（～に）従事する（in / with）','を変える,移す、変わる、移動する','を採用する、（態度など）をとる、を養子にする','を得る、を習得する','（を）拡大する、（を）詳説する','を拒む、を断る、拒絶する','の心を打つ、を襲う、を打つ、（に）ぶつかる','（を）繰り返す、を復唱する','を消費する、を食べる,飲む','を混同する、を当惑させる','を選ぶ,えり抜く','（徐々に）発展する、進化する','を納得［確信］させる','を思い出す、を呼び戻す','を破壊する、（人）を破滅させる','を保存する、を保持する、を保護する','を準備する、を組織する','（人）に（～を）警告［注意］する（of / against）','（問題など）に対処する、に演説する、（手紙など）を（～宛てに）出す（to）','を操作する、機能する、手術する','参加する','を取り巻く、にまつわる','流れる、（～から）生じる（from）','（人）を退屈させる,うんざりさせる','（と）不平［苦情］を言う、訴える','を主催する、のホスト役を務める','を（～と）結び付ける（with）、（～と）結び付く（with）','を伸［延］ばす、伸びる、及ぶ','を正当に評価する、を鑑賞する、を感謝する','（到達・攻撃）目標、的','要素,成分、元素、〔an / ofで〕少しの','原則,原理、主義,信条','現象','〔the ～〕大気、雰囲気','起源、源','個性,性格','（最大）容量,収容能力、（潜在）能力','利益、収益（率）、得','〔通例～s〕状況,事情、境遇','〔～s〕作法、方法、物腰','脅威、（悪い）兆し、脅迫','居住者、滞在者','富、資源、富裕','機関、協会、施設、制度','（関係）当局、権威、権限','投票、投票結果、〔the ～〕選挙権','光景、〔the ～s〕名所、見（え）ること、視野、視力','運動、軍事行動','〔しばしば～s〕基金,資金','ウェブ、（クモの）巣','象徴,シンボル、記号、標章','分析（結果）','（本・製品などの）版、解釈','観点,見方、大局観、遠近法','危機','災害、惨事','講義,講演、説教','心理学、心理（状態）','（社会的・文化的）性,性別','（社会的な）慣習、〔～s〕税関、〔～s〕関税','裁判所,法廷、裁判、宮廷、中庭','砂漠、不毛の地','土地,土壌、（悪事などの）温床','農業、農学,畜産','化石、時代遅れの人［物］','（公）文書,書類、記録,資料','語彙','聡明な、知能を有する','意識して,気づいて','能力がある、有能な','正確な、精密な','基本的な、必須の','人工の、不自然な','確固たる、堅固な、安定した','総合的な、全体的な','田舎の,田園の','軍の,軍事（用）の','核の,原子力の','生物学（上）の','絶え間ない、一定の','（人・規律・事態・天気などが）厳しい、猛烈な','視覚の、目に見える','莫大な,巨大な','便利な,都合のいい','家庭の、国内の、（動物が）飼いならされた','大規模な,大量の、大衆（向け）の','典型的な、（～に）特有の（of）','海外へ','それにもかかわらず','を論証［証明］する、デモをする','振る舞う、作動する','を教育する、に教える、（能力など）を養う','を購入する','を勧める','（を）（しぶしぶ）認める、に（～への）入場［入学など］を認める（to / into）','を生み出す、（電気など）を発生させる','（を）調査［探究］する、（を）探検［探査］する','をびっくりさせる','を引き裂く、裂ける','を解決する、（に）移り住む、を落ち着かせる','を持つ［する］余裕がある、を与える','と結論づける、を締めくくる、を締結する','を宣伝する、（～を求める）広告を出す（for）','に遭遇する、に（思いがけず）出会う','に思い出させる','〔受身形で〕位置する、の位置を探し当てる','を援助する,助ける','（を）かむ,（に）かみつく、（を）刺す','を配達する、（演説・講義）をする、子を産む','に気づく、を知覚する、を理解する','を区別する','を暗に意味する、を必然的に伴う','を処理する,扱う、を論じる、を商う','を（～のことで）賞賛する（for）、賛美する','訴える、抗議する、（上級審に）上訴する','（を）強く主張する、要求する','競う、〔通例否定文で〕（～に）匹敵する（with）','を位置づける,評価する、（ある地位に）位置する','を否定する、を拒む','を拒否する','を意図する','をさらす、を暴露する、を露出する','に賛成する、を好む、をひいきする','（人）を奮起させる、を喚起する','を提案する、をもくろむ、結婚を申し込む','（語）をつづる、という語になる','呼吸する、を吸う','を修理する、を修復する','（～から）成る（of）、（～に）ある（in）','意見,コメント、批判','〔通例～s〕指示、〔～s〕（製品の）使用書','宗教、信条、信仰（心）','地域、近所','実験室,研究室','存在、出席、面前','自信、信頼、秘密','害,損害','器具、楽器','部類,区分、範疇','資本、首都、大文字','結果、成果','概念,観念、見解、意向','（書物などの）論評、再調査、【米】復習','特性','多様性、相違点','犠牲（者）,被害者','場合,時、行事、機会','施設,設備、機能、才能','在庫品、蓄え、株','会議、協議','人類、人間性、人情、人文科学','方言','割合、部分、釣り合い','助言,秘訣、チップ、先端','弁護士','（漠然と）物、素材、素質','快適さ、慰め','哲学、原理、人生観','哺乳動物','量、分量','風景、領域、状況','部族、仲間','器官,臓器、組織、（パイプ）オルガン','試み,（品質・性能などの）試験、裁判、試用期間','規範、標準','規範、暗号、法典','物質、実体、趣旨','多様な、種々雑多な','非常に数の多い','狭い、細い、限られた','広範囲にわたる、広く普及した','（～に、...するのに）十分な（for、to do）','適切な、正式の、〔名詞の後ろで〕主要な、（～に）固有の（to）','言語の,言語学の','年1回の,例年の、1年間の','現代の、同時代の、同年輩の','（～と）反対の（to）','（規則などが）厳しい、厳格な','市民の、民間の、民事の','奇妙な、奇数の','不明の、（～に）知られていない（to）,無名の','よりすぐれた','敏感な、神経質な、微妙な','（人・気質などが）激しい、暴力的な','仮想の、事実上の','（～に）かまわない,無頓着な（of）','即座の、当面の、すぐそばの、直接の','重要な','いくぶん,多少','を解釈する、（を）通訳する','を翻訳する、を（～に）変える（into）','（を）集中する','に（...するように）頼む（to do）、を要請する','を批判する、を批評する','を克服する','を得る','に知らせる、情報を提供する','を確実にする、を守る','を発表［公表］する,知らせる、（物事が）を告げる','（人）に（許可・権利など）を与える、を認める','凍る、を凍らせる、（計画・資金など）を凍結する','に反対する、を対抗［対比］させる','異なる','をひどく嫌う、を残念に思う','を強調する、を重視する','を雇う、を使う','（功績など）を（～に）帰する（to）、を信じる','を変える、変わる','を建設する、を構成する','生じる','を打ち負かす、（を）打つ,たたく','を後悔する','を変える、変わる','を吸収する、を併合する、を夢中にさせる','を失望させる、（希望など）をくじく','を治す、を取り除く、（病気が）治る','を輸送する、を運ぶ','急いで行く、性急に行動する、をせき立てる','を掛ける、を絞首刑にする、垂れ（下が）る','を責める、の責任を負わせる','を（法的に）禁止する、を締め出す','を魅了する','回復する、を取り戻す','を祝う、を挙行する','を製造する、をでっち上げる','影響し合う、相互に作用する','の段取りをつける、を手配する、を配置する','を調整する、を適合させる、順応する','を確認する、を裏づける','見識,理解（力）、洞察力','革新、新機軸','予算、経費','料金、謝礼','〔～s〕経費、費用、犠牲','借金,負債、恩義','貸付金,融資、貸すこと','義務、職務、関税','不安,恐れ、警報装置','緊急（事態）','民主主義,民主政治、民主国家','大臣、（プロテスタント系の）聖職者','仲間,同僚、同級生、男','（～の）候補（者）（for）、志願者','（大）企業、法人','固定観念、決まり文句','道（筋）、路線,ルート、（～の）手段（to）','障害,（心身の）不調、混乱','憂うつ、うつ病、不況、低気圧','兵器,武器','（他国からの）移民,移住、入国管理','（～に対する）障壁（against / to）、防壁','不利（な点）、障害、（信用などの）損失','気分、機嫌、雰囲気','動き,動作、運動、動議','決まり切った仕事、いつもの手順','規律,しつけ、訓練、懲戒、学問分野','作り話、神話','仮説、憶測','【主に米】 医師、内科医','顧客、（弁護士などの）依頼人','植民地、集団居住地、（動植物の）コロニー','統計、統計学','穀物、粒、きめ','材料,成分、（成功の）要因','宝物,財宝、財産',
    '契約（書）、協定','福祉,幸福','主要な,最も重要な、最適な、極上の','好奇心の強い、奇妙な','劇的な、演劇の','明らかに異なる、明瞭な','心配して、切望して','必要不可欠な、活気のある、生命にかかわる','従来の、月並みな','抽象的な','重要でない、小さい','並はずれた、異常な,驚くべき','安定した、動じない','融通の利く,柔軟な','簡潔な、短い','攻撃的な、意欲的な','（目に）見える）、明白な','思いがけない,不意の','民族の,人種の、民族特有の','（～にとって）異質の（to）、外国の、宇宙人の','初めの','正確な、まさにその','正確な、精密な、まさにその','後者の,後半の','献身する、（罪など）を犯す、を投入する','を刺激する','（価値など）を高める,増す','を追求する、に従事する','反応する、化学反応を起こす','不賛成である、意見が食い違う','じっと見る、を見つめる','を捨てる、を放棄する,断念する','をやめる、（場所）を去る','をとらえる、をとりこにする','を移す、を伝える、移る、乗り換える','を悩ます、（～を）気にかける（about / with）','を説得する、に確信させる','を賃借りする、を賃貸しする','を繁殖させる,育てる、繁殖する','（を）投資する、に（～を）与える（with）','を予約する、を取っておく、（判断など）を保留する','（足跡・起源など）をたどる、を捜し出す','を説明する、に挿絵を入れる','に忠告［助言］する、（を）助言する','を伝える、を運ぶ,運搬する','を（取り）付ける、を付与する','を伸ばす、を広げる、伸びる、及ぶ','を当惑させる','をかき乱す、を妨害する、を動揺させる','衝突する,墜落する、をぶつけて壊す','うまく処理する','を許可する','を感動させる、に印象を与える','ではないかと思う、（人）を疑う','を動揺させる、をだめにする','（人）を怖がらせる','を輸入する）、を取り込む','（を）輸出する','を調査する、を究明する、（～を）調査する（into）','を監視する、を傍受する','を計算する、を予測する','を取り除く','を軽減する、和らぐ、緩む','を開始する、を売り出す、を発射する','連続、一連（のもの）','療法、心理療法','症状、兆候）','出来事,事件、紛争','目撃者 eyewit、証人、証拠,証言','（金）額、合計、要点','負担、（重い）義務、積み荷','口調、音色、雰囲気、色調','光栄、名誉、敬意','（～の）賞（for）、（証書などの）授与','優先（事項）','論理、道理、論理学','最小限度','（～の）例外（to）','（～の）手がかり（to / about）、（パズルの）ヒント','絆、債券、束縛、接着剤','ウイルス、（感染症の）病原体','（外科）手術、外科,外科医学','保険、保険料、保険金','枠,（額）縁、骨組み、体格','避難（所）,保護','領土、（活動の）領域、（動物の）テリトリー','境界（線）、〔通例～ries〕限界','生息地、（人の）居住地','地区、行政区','（動植物などの）保護、保存','収穫（物）、収穫期、漁獲高','捕食動物、略奪者','わな、苦境','こつ、策略、いたずら、芸当','責任、欠点、誤り','割引','偏見、傾向','協力,共同','特許（権）、特許品','対話,会話、意見の交換','構成要素、部品','評判、名声','言葉の、口頭での、動詞の','内部の、国内の、内面的な','しっかりした、硬い、固体の','（～から）遠く離れた（from）、かけ離れた','主要な、資本金の','高性能の,精巧な、洗練された','等しい,相当する','理性的な、合理的な','関係がある、適切な','絶対的な','頻繁な','永続的な','強烈な、熱烈な','意味のある','邪悪な、有害な','絶滅した、廃止された','無作為の、手当たり次第の','生の、未加工の','無礼な、粗野な','単なる,ほんの','熱帯の','前へ,先へ、それ以降','を所有している、の心をとらえる','を支配する、（～より）優勢である（over）','を保証する','溶ける、なごむ、を溶かす','に恥ずかしい思いをさせる','（人）にやる気をなくさせる、を落胆させる','を感知する、を見つけ出す、に気づく','をささげる','に（強く）促す、を強く主張する、を駆り立てる','を貸す、（人）に（助言・援助など）を与える','を制限する','を孤立させる','に同行する、に付随する','を疲れ果てさせる、を使い尽くす、排気する','を悩ます、〔受身形で〕腹が立つ','を危険にさらす','（事実など）を認める、に謝意を表す','に（～のことで）敬服［感心］する（for）','を評価する、を査定する','を宣言する、を申告する','を確保する、を守る','専門とする、【英】（～を）専攻する（in）','（結果など）を（～に）帰する（to）','（の）ふりをする','を埋める、を埋葬する、を隠す','を逆転させる、を反対にする','に抵抗する、〔通例否定文で〕を我慢する','をおびえさせる、を脅す','をまねる、を模造する','（を）援助する、を手伝う','に似ている','（～から）引退する,退職する（from）、退く','をおろそかにする,怠る、を無視する','崩壊する、（人が）倒れる、を折り畳む','を改革する、を改心させる','（に）抗議する、を主張する','に借りがある、のおかげである','を持続させる、を支える','を割り当てる、を（～に）配属する（to）','を成し遂げる','知恵、賢明さ、学識','読み書きの能力、（特定分野の）知識','遺産','使命、（外交）使節団、布教','免許（証）、許可','〔通例the ～〕〔集合的に〕エリート','層','モーター、原動力','たんぱく質','職業、専門職、同業者仲間','編集者、編集長','仲介者,代理人、薬剤','地球、世界、球','避難所,保護区、港','列、（建物が並ぶ）通り','犠牲、いけにえ','〔単数・複数扱い〕手段、〔複数扱い〕資力,収入','集まり、（議会の）会期、（開会中の）議会','（競技）連盟、同盟','コンテスト,競技（会）、争い','警備員、警備隊、監視,警戒','（試合・論争などの）相手、反対者','（～を）ちらっと見ること（at）','離婚、分離','（生物の）組織、ティッシュペーパー','液体','不平等、不公平な事柄','（～に対する）偏見（against）','公正,正義、司法','指針,ガイドライン、指導基準','プラットフォーム、演壇、舞台','（社会・経済などの）部門,セクター、（都市内の）地域','チャンネル、伝達経路、海峡','氷河','霊長目の動物','（使）用法、語法、習慣','財産、幸運、運命','相互関係,相関（関係）','芸術的な','文学の、文語の','第一級の、典型的な、定番の','自由主義の、寛大な、一般教養の','具体的な、有形の','わずかな、取るに足らない','連邦（政府）の','原始的な、未開の','（～に）不慣れな（with）、（～に）（よく）知られていない（to）','微妙な、（気体などが）希薄な','明らかな、平易な、飾りのない、率直な','海の、船舶の','明白な、一見～らしい','気が進まない,嫌がる','一時的な','罪悪感のある、（～について）有罪の（of）','王の','純粋な、潔白な、まったくの','信じられない、すばらしい','（～を）熱望して（for）、熱心な','十分な、適切な','～経由で、～の媒介で','を評価する、を査定する','賛成する、を承認する','と述べる、（～について）意見を述べる（on / upon）','（危険）を引き起こす、（問題など）を提起する、ポーズをとる、（～を）装う（as）','をもたらす、を（～に）譲る（to）、（～に）屈する（to）','を示す,見せる、を展示する','を（～に）分配する（to）、〔受身形で〕分布する','を命じる、を指揮する、（景色）を見渡せる','（空間・時間）を占める、を占領する','ひょいと動く、不意に現れる、ポンとはじける','を積み重ねる、積み重なる','に挨拶する、を迎える','（～に、～のことで）謝る（to、for）、弁明する','をいら立たせる、（計画・希望など）を挫折させる','を和らげる、〔受身形で〕（...して）安心する（to do）、を解放する','由来する、を引き出す、を推論する','に値する','（～を）じっと見る（at / into）','を負かす、を失敗させる','を変える、を改宗［転向］させる、を交換する','と結婚する、を（～と）結婚させる（to）','を喜ばせる、（～を）大いに喜ぶ（in）','を押し上げる、を増加させる','に耐える、（に）持ちこたえる','一致する、（～に）相当する（to）、文通する','を課す、を押しつける','を救う','を解決する、を決意する、を議決する','を記録する,登録する、（～に）登録する（for）','を中断させる、（の）邪魔をする','から（～を）取り除く,除去する（of）','を禁止する','を構成する、を創作する、を鎮静する','（を）誤解する','を罰する、に損傷を与える','をだめにする、を破滅させる、破滅する','を防御する、を弁護する','を受け入れる、（を）抱擁する、を包含する','を修正する、を緩和する','（人）に資格を与える、資格がある','情熱、熱中、激怒','（～への）熱情,熱意（for）','段階,局面、側面','方式、気分、形態、流行','期間、範囲','重力,引力、重量、重大さ','軌道、（活動・勢力などの）範囲','小惑星、ヒトデ','核心、芯','精神、魂,霊魂、生気','神経、〔～s〕神経過敏、（...する）度胸（to do）','感染（症）','【主に米】 モール,ショッピングセンター','食料雑貨、食料雑貨店','ユーモア、気分,機嫌、気質','本能、勘,直感、（自然に起こる）衝動','（～への）信頼（in）、信仰（心）','勇気','動機（づけ）、報奨金','見込み、〔～s〕（未来への）展望、有望な人','（～に対する）障害（物）（to）','建築、建築様式、構造','（草木の）茎,幹','錯覚,思い違い、幻想','（～に対する）差別（against）、区別','恥、残念なこと','干ばつ、（慢性的な）不足','風味、特色','部分、1人前、割り当て','調理法,レシピ、手順、秘訣','ぜいたく（品）、〔形容詞的に〕豪華な','小片,破片、欠けた箇所、集積回路','儀式、（日常の）習慣的行為','〔for the ～ ofで〕のために,の目的で、に免じて','（日本の）県,府、（フランスなどの）県','（地方）議会、評議会、（公の）会議','管理（部）、行政、政府（機関）','教育課程,カリキュラム','貴重な、高価な','寛大な、気前のよい、豊富な','何気ない、形式ばらない','楽観的な','粗い、大まかな、乱暴な','不愉快な、不親切な,無礼な','北極の','究極の','耳が聞こえない','本物の、偽りのない','体［手］を使う、手の、手動式の','機械の、機械的な','即時の,すぐの、即席の','余分の,予備の','（～に対して）免疫を持つ（to）、（～を）免れた（from）','厳しい、（光・色・味などが）不快な','集団の,共同の','避けられない','重大な、深い、難解な','着実な,一定の、安定した','成熟した、熟した','同様に','（を）追跡する、（を）追求する','を告訴する、（～を求めて）訴訟を起こす（for）','じっと見る','滑る、滑り落ちる、そっと動く','に積む、に負わせる','を圧倒する、を（精神的に）打ちのめす','歩き回る、それる、はぐれる','漂う,浮かぶ、を浮かべる','を注ぐ、激しく降る、押し寄せる','を代わりに使う、（～の）代理をする（for）','を発音する、を宣言する','縮む,縮小する、減少する、ひるむ','を回復させる、を修復する','を引き起こす、のきっかけとなる','をつかむ、を横取りする、を急いで食べる','を保持する、を覚えている','を複製する、を繁殖させる、繁殖する','上下に動く、急に動く、を上下に動かす','を楽しませる、をもてなす','干渉する,介入する、邪魔する','を養う、を耕す、を栽培する','の根底にある','を予期する、楽しみに待つ','を正当化する','を規制する、を調整する','を走査［スキャン］する、をざっと見る、を注意深く調べる','を分類する、を機密扱いにする','を提出する、〔submit oneselfで〕（～に）従う（to）','（一時的に）中止する、（一瞬）立ち止まる','傾く、寄りかかる、をもたせかける','ぶつかる、をぶつける','を折り畳む、（両腕）を組む、（折り）畳める','躊躇する,ためらう','（液体・気体）をポンプで送り込む、をくみ出す、を注ぎ込む','を据えつける、に着手する、（自転車など）に乗る、増える','を超える、に勝る','を経験する、（手術など）を受ける、に耐える','に立ち向かう、（困難などが）に立ちはだかる','（に）相談する、を参照する','を実現させる、を果たす、を満たす','特権,特典','形成、構成（物）、隊列','側面,局面、次元、寸法','ニューロン,神経単位','感覚、大評判','図,グラフ、海図、ヒットチャート','〔the ～〕地理、地理学','（専門家の）一団、討論者一同、羽目板','【主に米】 （2学期制の）学期','労働人口,総労働力、全従業員（数）','製造工場、製粉所、粉ひき機','乱用、虐待','（道徳上の）悪、欠点','運命、結末、最期','悲劇（的な事態）','（予想される）筋書き,事態、脚本','アレルギー','（銃弾・刃物などによる）傷、痛手','〔通例～s〕抗生物質','ワクチン','隠喩、比喩','人々、〔～s〕皆さん、家族','（乗り物の）料金','移り変わり、過渡期','最大限','星雲,銀河、銀河系','鉱物、ミネラル','骨格、骨組み、概略','相当する物［人］','脳卒中、（ボールを）打つこと、（雷などの）一撃','歩行者','（野山などの）小道、跡、手がかり','生態学、生態系、環境保護','きょうだい（の1人）','比率','混合（物）','魅力、お守り','（～に対する）願望,野望（for）、野心','卓越した、目立つ','急進的な、根本的な','即座の,迅速な','形式ばらない,略式の、（言葉が）くだけた','相互の、共通の','中立の、（特徴・表情などが）はっきりしない','警戒して、敏速な','磁気の、磁石の、人を引きつける','極地の、電極の','流ちょうな','外部の、対外的な','受動的な、消極的な','ひどい、嫌な、ものすごい','無関係の、血縁関係がない','残酷な、むごい','偽の、見せかけだけの','（攻撃などに）弱い,もろい、傷つきやすい','緊急の','精神の、霊的な','謙虚な、適度な、質素な','熱心な、鋭敏な、（感情・関心などが）強い','それにもかかわらず,それでもなお','交渉する、を（交渉して）取り決める','を把握［理解］する、をしっかり握る','を寄付する、（臓器・血液）を提供する','を逮捕する、を止める、（注意）を引く','ひびが入る、にひびを入れる','を軽くたたく、（液体）を出す、を盗聴する','を分割する、を分担する、分裂する','を予想［予測］する','を除外する','を見落とす、を大目に見る、を見渡す','破裂する、（～を）突然始める（into）','（人・傷など）を治す、治る','を禁じる','をインストールする、を設置する、を就任させる','を減らす、減少する','を引き合いに出す、を引用する','を引用する、を引き合いに出す','に異議を唱える、（を）議論する','を目立たせる、強調する','（注意など）をそらす','をだます、不正をする','をはぐくむ、を養育する、を心に抱く','に従う、に服従する','を曲げる、を屈服させる、曲がる','から（権利などを）奪う','（を）統治する、支配する','ログオンする、を記録する','を伝える、（電波・信号など）を送る','をいじめる、を脅す','跳ぶ、さっと動く、急上昇する','を驚かす','をぞくぞくさせる、わくわくする','うなずく、会釈する、うとうとする','おじぎする、屈服する','を混ぜる、を調和させる、（～に）溶け込む（into）','を複雑にする','を投げる、倒れる、縦揺れする','続く、固執する','をささげる、を献呈する','に備えつける','前提、〔～s〕（建物を含めた）構内、敷地','入力（情報）、投入、（情報・時間などの）提供','利点、功績、真価','同情、（～に対する）共感（with/for）','賛辞、表敬','インフラ、基本的施設、（経済）基盤','光線、ひらめき、一筋の光明','苦悩、苦痛、困窮','関節、接合（部）','遠征（隊）、探検（隊）','青年、青年期の','（日）陰、色合い、日よけ、微妙な相違','陪審（員団）、審査員団','倫理、道徳、〔～s〕倫理［道徳］規範','（刑）罰、罰金、ペナルティー','能力、機能、学部、教授陣','計画、体系、陰謀','栄養（の摂取）','（微）粒子、ほんのわずか','分子、微粒子','国籍、国民、国民性','世論調査、投票（数）','診療所、クリニック、（病院内の）～科','認知症','疲労','ジレンマ、板ばさみ','【英】（順番を待つ）列','（道路などの）カーブ、曲線','物語、話、（小説の）叙述部分、地の文','指紋','ファイル、（書類の）とじ込み','荒野、（庭・町などの）放置された部分','殺虫剤、除草剤','パニック（状態）、狼狽','織物、布（地）、構造','空想、幻想、幻想的作品','（気まぐれな）好み、空想、思いつき','美徳、長所、効能','感謝している','妥当な、有効な','入念な、凝った','適度な、穏健な','活動的な、精力的な、動的な','勇敢な、見事な','すばらしい、才能にあふれた、きらめく','途方もない、莫大な、すばらしい','口頭の','無罪の、無邪気な、無知の','その後の','浅い、浅薄な','無関心な','より劣った','気まずい、ぎこちない、厄介な','肥満した','妊娠した、（～で）満ちている（with）','親密な、密接な','中世の、時代遅れの','神聖な、宗教的な、厳粛な','（～と）同時に（with）、一斉に','〔A ～ Bで〕A対B、AかBか','進む,進行する、（～を）続行する（with）','（人）を（環境などに）慣らす（to）、〔受身形で〕（関心などが）（～に）向いている','（インターネット上の情報など）を見て回る、サーフィンをする','をろ過する、を取り除く','を縛る、を束縛する、を結び付ける','（好ましくない手段に）訴える,頼る（to）','を強化する、を補強する','を蓄積する,集める、積もる','と確信する,断言する、（金などを）かける','を主張する、を擁護する','を構成する、になる,に等しい','を引き受ける、を保証する、に着手する','を握る、をとらえる','（意見など）を退ける、を解雇する','薄れる、衰える','を隠す、を秘密にする','（を）かむ、をかみ砕く','（を）飲み込む、をうのみにする、に耐える','を密閉する、に封をする','移住する、（鳥などが）渡る','（を）誇張する、を強調する','を非難する、を告訴する','消える','を磨く、を洗練させる','を拭く、を拭き取る、を消し去る','（を）掃く、を一掃する、さっと通過する','を誤解させる,欺く、（人）を間違った方向に導く','を台無しにする、を甘やかす、だめになる','を悪化させる、を合成する、を混合する','爆発する、急増する、を論破する','をむかつかせる、に愛想を尽かせる','通勤［通学］する','を装飾する','を延期する','をやめる、終わる','妥協する、を危うくする','を選出する','を取り［搾り］出す、を抜粋する','を受け継ぐ、を相続する','（人・動物・植物）を育てる','感情移入,共感','合図、手がかり、（次の演技の）キュー','企業,事業、企画、進取の気性','生産（高）、出力、排出（量）','（米国などの）議会、会議','千年間,千年紀','人類','イスラム教徒','（動産・不動産などの）財産、私有地','地雷','用心、警告','論争','総意、（意見の）一致','小売り','繊維（質）、本質、精神力','（よい）香り、香水','（水以外の）飲み物,飲料',
    '栄養補助剤,サプリメント、補足','糖尿病','州,省、〔the ～s〕地方、分野','（岩や砂の）礁、暗礁','微生物、細菌','過剰,超過','美術館,画廊、観客,ギャラリー、回廊','名声','締め切り','学部学生','奴隷制度、苦役','獲物、犠牲者','散らかった状態［物］、混乱状態','不況、後退','後退,退却、（計画・決定などの）撤回','墓、〔通例the ～〕死','コラム、（新聞などの）欄、円柱、（縦）列','〔集合的に〕景色、背景','（小説などの）筋、陰謀','彫刻（作品）','タブレット（型情報端末）、錠剤、平板','密集した,密度の高い、（霧などが）濃い','外来の、異国風の','酸性の、酸っぱい、辛辣な','苦い,つらい、辛辣な、怒りっぽい','賢明な、実用的な、顕著な','高貴な、堂々とした、高潔な','漠然とした,あいまいな、おぼろげな','（～と）平行［並行］の（to）、類似した','張り詰めた,緊張した','垂直の、縦方向の','原産の,先住の、（その土地に）固有の','〔通例A～〕アボリジニの、原生の,先住の','季節の,季節的な','豊富な、（～に）富む（in）','ハイブリッドの、雑種の、混成の','（～にとって）無関係の（to）、見当違いの','ばかげた、法外な','妖精の（ような）','感覚の','慢性の、長引く、常習の','自発的な、無償の','傾向がある、傾いた','を推論する,推測する','を尊敬する、を見なす','に取り組む、と（～のことで）話をつける（about / on）','危険を冒して進む、を思い切ってする','を加速させる,促進する、加速する','（人）を慣れさせる','をおもしろがらせる,楽しませる','繁栄する、繁茂する、を振りかざす','繁栄する,うまくいく、繁茂する','をはぐくむ、を養成する','（を）クリックする、をカチッと鳴らす、カチッと音がする','回転する、を回転させる、（糸）を紡ぐ','を切り抜く、を（はさみで）切り取る、をクリップで留める','を引きずる、ぐずぐずする','を投じる、に役を当てる','をまき散らす、分散する','を（...する）気にさせる（to do）、を引きつける','を引き出す、を撤回する、撤退する','あくびをする','まばたきする、点滅する、（目）をまたたく','を染める、染まる','をこぼす、こぼれる','をいらいらさせる、をひりひりさせる','を侮辱する','を施行［実施］する、を（～に）強制する（on / upon）','から（金品を）奪う','（液体）を流出させる、（液体が）流れ出る','を停職［停学,出場停止］にする、を一時的に中断する','漂う、さまよう、を押し流す','を許す、を免除する','を修正する、を改訂する','を募る、に新人を補充する','をねじる,ひねる、を歪曲する','を押しつぶす、を弾圧する、を絞り出す','をピンで留める、を突き刺す','を暴く、を 発掘する','を活用する、を搾取する,につけ込む','を実行［実施］する','を統合する、融合する','を取り入れる、を法人にする、合併する','人物の紹介、横顔、輪郭','食欲、欲求','衝動、刺激','台本、筆跡','（～周年）記念日','年金','気質,気性、機嫌、かんしゃく','皮質、樹皮','症候群、～現象','（特定の目的の）部屋、議場、〔the ～〕議院','公共事業、公共料金、実用性','〔集合的に〕牛','（牛などの）群れ、群衆','流動体,液体','残念なこと、哀れみ','聖職者','知人、面識、知識','子孫,子、成果','飢饉、（食糧・物資の）ひどい不足','森林伐採','刑務所,拘置所','商品、有用なもの','書式,形式、（本などの）型','受け取る人、（臓器などの）被提供者','訓練、（反復）練習、ドリル,錐','無能,無力','共和国、共和制','戦闘、対立','（破壊された後の）残骸,瓦礫、がらくた','病原菌（が起こす病気）、虫、盗聴器、（機械・プログラムの）欠陥','わずか,一部、分数','指標、索引、指数','直観（力）,直感','動機','同意,承諾','（社会の）階層制、〔the ～〕支配層','記念碑,遺跡、金字塔','〔通例～s〕資産、価値のあるもの、利点','まずまずの、きちんとした、上品な','有能な、適任の、満足できる','単純な、率直な','化粧の,美容の、うわべの','繊細な、扱いにくい、もろい','室内の、内部の','透明な、明快な','美的な、美学の','故意の、慎重な','人口統計学の','有史以前の、旧式な','生まれながらの、固有の','穏やかな、（程度が）軽い','有毒な、中毒性の','恥じて','謙虚な、質素な、身分が低い','特有の、特異な','（傾斜が）急な、急激な、法外な','ささいな,取るに足りない','壮大な、見事な','無線（電信）の,ラジオの','継続している,進行中の','に自信を持って言う、を保証する','に先行する、に優先する','を復活させる、復活する','に強いる','花が咲く、発展する','を怖がらせる、を脅かす','（法律・規則など）に違反する、を侵害する','を抑える、を抑圧する','をだます','を（巧みに）操る、を改ざんする','飢える、（～を）渇望する（for）、を飢えさせる','（から）逃げる','（を）ささやく','叫ぶ,どなる','を置く、を預ける、を堆積させる','を限定する、〔通例受身形で〕閉じ込められる','を揺らす,振る、揺れる、（行動に）さっと移る','を長引かせる','を描く','の要点を述べる、の輪郭を描く','を捨て去る、（光など）を放つ、（涙・血）を流す','（光・熱など）を出す,排出する、（信号）を送る','を更新する、（資源）を再生する','を利用する','を主張する','に負担をかける、を緊張させる、を漉す','努力する、争う','あえて［思い切って］...する','を誇る、（を）自慢する','をびっくりさせる','の気分を害する、（に）違反する','（を）計算する、コンピューターを使う','を集める、を組み立てる、集まる','を悪化させる、悪化する','を（ぱっと）裏返す、を軽くはじく','（を）こする、（～に）を塗る（on / over）','（を）降りる、受け継がれる','補償する、に償う','から成る、を構成する','普及している、支配的である、（～に）打ち勝つ（over）','探究','尊厳、威厳','（判断・評価の）基準','逆説、矛盾','（英国などの）議会、国会議員（団）','法律、立法','協議事項（リスト）、議事日程（表）、（政治上の）課題','（活動・思潮などの）主流、大勢','〔～s〕軍隊、集団','流行（病）、蔓延','発生,勃発','混沌,大混乱','悪夢（のような状況）、不安感','恐怖、強い嫌悪、嫌な物［人］','集団、（植物の）房,束','花粉','ミツバチの巣（箱）、人の集まる所','灌漑','（薬の1回分の）服用量、放射線の1回の照射量','自殺、自殺的行為','祝宴、大ごちそう、楽しみ','（独特の）料理,料理法','うわさ','ことわざ','署名、特徴','方法,解決策、公式',' 授業料、（個人）指導','摂取量、受け入れ数、取り入れること','スペクトル、（波動・変動の）範囲','腎臓','用具（一式）,器具、歯車、ギア','（座席間などの）通路','深い悲しみ','運命','頭骨,頭蓋骨、頭脳','墓','修道士,僧','崇拝,礼拝（式）、賛美','際立った、未払いの、未解決の','前例のない、空前の','無限の、無数の','価値がある、立派な','不可欠な','義務的な,強制的な','十分にありそうな','あいまいな、多義的な','（世に）知られていない、不明瞭な','（～に）懐疑的な（of ⇒ about）','壊れやすい、虚弱な','静的な、動きのない','徐々の,緩やかな','声の,発声の、はっきりものを言う','鮮やかな、生き生きとした','帝国の、皇帝の','敵意のある','表面的な','乏しい、珍しい','総計の、甚だしい、粗野な','生来の,本来的に備わっている','注目に値する、著名な','を最新のものにする、をアップデートする','（気分）をさわやかにする、（記憶など）を新たにする、を最新のものにする','花が咲く、栄える','を征服する、を克服する','を引き起こす、を説得する','を獲得する,達成する、に達する','を吹きかける,に吹きつける','（情報）を検索する、を取り戻す、を回復する','を描く、（の役）を演じる','を引っかく、を取り消す,削除する','を指定する、を任命する','と矛盾する、に反対意見を言う','ため息をつく','を混乱させる、を分裂させる','出発する、（～から）それる（from）','（を）誘導する、（を）操縦する、（を）航行する','に（～を）切に頼む（for）、（を）懇願する','に住んでいる、に宿る,存する','（を）診断する','を理解する','に義務づける、に恩恵を施す','に詰め込む、詰め込み勉強をする','群がる,集まる','（を）過小評価する、（を）軽く見る、を少なく見積もる','を明確にする','を引き起こす、を刺激する、スパークする','をつかむ、を奪い取る、を没収する','急上昇する、空高く飛ぶ','光り［照り］輝く、赤く燃える、紅潮する','を（～に）変装させる（as）、を偽る','を歪める、歪む','を徐々にむしばむ、を侵食する','を廃止する','を［から］取り去る、を裸にする','〔dispose ofで〕を処分する、を（...する）気にさせる（to do）、を配置する','を投棄する、をどさっと落とす','を織る、（計画・物語など）を作り上げる','を洗練する、を精製する','を豊かにする、（物質）を濃縮化する','を調整する、を組織する、（服など）をコーディネートする','（新聞などの）見出し','【米】 実務［医学］研修、研修期間','直売店,特売店、はけ口、（電気の）コンセント','治療（法）、治療薬、解決法','錠剤,丸薬、〔the ～〕ピル,経口避妊薬','反応、宴会、受付、受信（状態）','（商）取引、（人と人との）交流','突然変異（体）、変化','〔集合的に〕乳製品、乳製品加工所［販売者］','同情','姿勢、心構え','悪態,ののしりの言葉、呪い、〔通例a ～〕災い','葬式','国勢調査、交通調査','百科事典','〔通例～s〕穀物、シリアル（穀物加工食品）','断片','（～の）部分,斑点、継ぎ、貼り薬','【英】 ごみ、つまらないもの','迷路、複雑に込み入ったもの','見解、見通し、眺め','大発見,飛躍的進歩','勝利、勝利の喜び、偉業','同盟国、提携者、援助者、盟友','（試合などの）観客','領域、球体、天体','【米】 郡、【英】州','利益,味方','（時間の）間隔、合間、隔たり、小休止','循環、流通、（新聞・雑誌の）発行部数','刃、（プロペラなどの）羽根、（草などの）葉','窃盗（罪）','真空、空虚','衝突、対立','買い得品、取引、契約','（ある場所の）目印、画期的な出来事','歳入、収益','（国家間の）条約、協定','最高の','徹底的な、まったくの','裸の','心からの、誠実な','飼いならされた,人に慣れた、退屈な','不十分な、不適当な','薄暗い、ぼんやりした','（痛み・感情などが）激しい、（知覚などが）鋭い、急性の','障害のある、障害者用の','大都市の,首都圏の','金銭的な、金融の','代わりの、交互の','部分的な、不公平な','神の、神にささげる','徹底的な,抜本的な、極端な','猛烈な、どう猛な','唯一の、単独の、独占的な','自然発生的な、自発的な','空間の','きちんとした、見事な','きちんとした,整頓された、相当の','（～に）忠実な（to）、誠実な','に恩恵を与える、に感謝する','を取り戻す','順応する、一致する','登録する,入会する、を登録させる','に権利を与える、に題名をつける','を止める、止まる','（感情・行動など）を引き起こす、を挑発する','を侵略する、を侵害する、（場所）に殺到する','押し入る、を押し込む、（を）搾る、（を）強く押す','はう、ゆっくり進む','を消化する、を理解する、を要約する','（声）を発する、（考えなど）を述べる','控える','に住む,の住民である、に人を住まわせる','を収容する、を（～に）適応させる（to）','（を）操縦する、を（～へ）向ける（to）','溺死する、を水浸しにする','を浸す、（手など）を（～に）突っ込む（into / in）、下がる','を浸す、をずぶぬれにする、浸る','をかき回す、を揺り動かす','を移植する、を移住させる','を安心させる','（を）再開する、を取り戻す','（と）推測する、投機する','を上回る','を任命する、（日時・場所など）を指定する','に興味を持たせる、陰謀を企てる','腐敗する、（徐々に）衰える','を汚染する、を堕落させる','膨張する,腫れる、を膨らませる','を削除する,消す','を許容する,我慢する','をうらやむ','（を）祈る','（を）告白する','（を）辞任する、を放棄する','（を）溶かす、（議会など）を解散する、（契約など）を解消する、溶ける','（閉じたもの）を開く、を明らかにする、開く、明らかになる','を目覚めさせる、（～から）覚める（from）','（を）思いつく、と想像する、（を）妊娠する','起業家,事業家','利害関係、〔通例～s〕賭け金、杭','余剰,過剰、黒字','インフレ（ーション）、（物価の）高騰','搾取工場','衝突、対立、かち合うこと、ガチャンという音','社会学','イデオロギー,思想傾向','余白、差、利ざや','領域、領土','分野、領域、ドメイン','アルゴリズム、問題解決の手順','大草原','〔通例the ～s〕最先端、〔the ～〕 【米】辺境地、国境','銃弾','盾,防御物','絶望','放射能,放射線','偽薬,プラシーボ、気休め','託児所、苗床','配偶者','化粧、化粧品、構成、性質','ミイラ、ママ,お母さん','（人・動物の）肉、果肉','手足','におい、気配','洗濯（物）、クリーニング店','潮（の干満）、動向','アンケート','ばかげた物［話,考え］、無意味な言葉','復讐','知性、〔the ～（s）〕知識人','親切なもてなし,歓待、受容性','司書,図書館員','（手書きの）原稿、写本','（考えなどに）取りつかれること、妄想、強迫観念','衛生（状態）、健康法','理論的枠組み,パラダイム、模範','合法的な、妥当な','本物の、信頼できる','経験的な、経験主義の','膨大な','ばかげた、不合理な','異様な,奇妙な','偶然の、過失による','不安な、落ち着かない、ぎこちない','嫉妬深い、用心深い','女らしい','素早い','空洞の、空虚な、うわべだけの','大まかな、粗野な、未精製の','痛い、腹が立って','悲観的な','無駄な、うぬぼれた','（～の）影響を受けやすい（to）、感染しやすい','食用の,食べられる','純然たる,真の、すごい、（布が）薄地の','明白な、率直な','（～に）なりやすい（to）、（...する）傾向がある（to do）','裕福な、豊富な','共同して働く、（～に）協力する（with）','を及ぼす、（力など）を行使する','（～で）秀でている（in / at）、に勝る','栄える,成功する、繁殖する','殺到する、（感情が）こみ上げる、急騰する','（～に）介入する（in）、介在する','を挿入する','を追い抜く、に追いつく、（災難・強い感情などが）を襲う','をパチンと鳴らす、をポキッと折る、ポキッと折れる、パチンと音を立てる','を彫る、を切り開く、（肉）を切り分ける','〔受身形で〕（～の）中毒になる（to）、（～に）凝る','を非難する、〔受身形で〕（～の刑を）宣告される（to）','に有罪を宣告する','を指図する、を書き取らせる、を規定する','（薬など）を処方する、を規定する','を抑制する、を妨げる','はぐれる,（道に）迷う','（を）歩き回る、放浪する','を同封する、を取り囲む','を実行する、を処刑する','同時に起こる、一致する','遅れる、徐々に弱まる','しがみつく、くっつく','を消す','（穀物など）をひく','を編む、を結合する、編み物をする','（を）尋ねる','をうっかり表す、を裏切る','漏れる、を漏らす','を粉砕する、を強打する、粉々に壊れる、激突する','跳ねる、反射する、を弾ませる、（Ｅメールが）（宛先不明で）返送される','（都市などが）不規則に広がる、だらしなく手足を伸ばす','（～と）会話をする（with）','を暗唱する、を詳述する','を無視する、を軽視する','眉をひそめる','を呼び起こす','を誓う,約束する、を与えることを約束する','（～を）熱望する（to）','（を）熟考する、を予想する','優美,優雅、分別、（神の）恩寵','啓蒙,啓発','商業、貿易','下書き、為替手形、隙間風','バレル（液量の単位）、たる','木材、樹木','衣服','糸、（議論などの）筋道','内閣、戸棚','（官庁の）局、事務局、案内所','（個人の）自律、自治（権）、自治体','損害（の程度）、死傷者数、通行料','話し合い,会話、講演、論説','迷信','ちらりと見えること','計算、算数','用語小辞典、用語集','〔しばしば～s〕記録文書,公文書、公文書保管所、（コンピューターの）アーカイブ','遺産','人類学','激怒、猛威','悲しみ','精神科医','行政区、病棟','露店、エンスト、失速','炎、情熱','水分、湿気','皮肉','戦士','天文学','（無人）宇宙探査機、（～の）精査（into）、探り針','高度,標高','腫瘍、腫れ物','欠陥、不足','公衆衛生（学）、下水［衛生］設備','長寿、寿命、長年勤続','（活動・能力などの）範囲、余地','感情、感想、感傷','もっともらしい','精力的な、激しい、活力のある','男らしい','厳しい、硬直した','不都合な、逆の','一貫した,筋の通った、結束した','文字どおりの、逐語的な、散文的な','恣意的な、独断的な','匿名の','骨董の,アンティークの、古風な','永遠の、不変の','中級の、中間の','（～より）下位の（to）、副次的な','陰気な、薄暗い、悲観的な','熱の,熱による、保温用の','かすかな、めまいがする、弱々しい','お人よしの,愚直な、純朴な','（...する）傾向がある（to do）、適切な、利発な','横柄な,傲慢な','外向的な、社交的な','目立つ','損なわれていない,手つかずの','を具現する、を包含する','を照らす、を解明する','を慰める','の正しさを証明［確認］する','を公表する,暴く','を積む,積み重ねる、〔～ upで〕（車が）渋滞する','回転する、循環する、を回転させる','に（...することを）強いる（to do）、を抑える','を妨げる','に耐える','（を）ツイートする,つぶやく','くしゃみをする','（火山が）噴火する、勃発する','をぼかす、を曇らせる、をあいまいにする','（一部）重なる、（と）重複［共通］する','〔通例受身形で〕埋め込まれる,はめ込まれる','に取って代わる、を移動させる','を（ある状態に）する、（援助など）を与える','（～に）（を）突っ込む、没頭する、陥る','を放棄する,引き渡す、（～に）屈する（to）','のプラグを電源に差し込む、を（～で）ふさぐ（with）','（を）吸う、（を）しゃぶる','をばかにする、のまねをしてからかう','（を）からかう、をいじめる','をなだめる、を和らげる','を汚す、に着色する','を避ける','よろけながら歩く、（～に）つまずく（on / over）','を紅潮させる、を水で流す、紅潮する','を損なう','と思う、と推定する、を前提とする','と主張する、競う','うなる,ほえる、大笑いする','（記憶・考えなどが）につきまとう、（幽霊などが）に出る、によく行く','（注意など）をそらす、を迂回させる、（資金など）を転用する','を待つ','を（行って）持って［連れて］くる','を統合［統一］する、統一される','を点検する、を視察する','を伴う,引き起こす、（...すること）を含む（doing）','作戦,方策、戦術,戦法','偉業,功績、妙技','名声、〔形容詞的に〕名声のある','類推、類似','良心、分別','織物、繊維（産業）','赤字,不足、欠陥','疫病、（害虫などの）異常発生','危険（要素）、偶然','（新陳）代謝,代謝作用','麻痺、〔比喩的に〕麻痺（状態）','（電気などの）供給網、格子（模様）、碁盤目','馬車、車両、立ち居振舞い、【英】輸送','不和、摩擦','反逆者','政権,政体、体制','独占（権）','必需食品、主要産物','商品','物売り,行商人、自動販売機','監督者、指導教員','前任者、前のもの','〔集合的に〕職員,社員','船舶、容器、（体液が通る）脈管','肝臓','（時間の）継続,持続（時間）','証明書、免許状','幾何学','（左右）対称、調和','伝記','傑作','押韻詩、韻、〔通例～s〕詩歌',
    '保険料、プレミア、景品','崩壊、（神経）衰弱、故障、内訳','礼儀正しさ、好意、優遇','（条約）議定書、外交儀礼、プロトコル','標本、実例','論文、命題,テーゼ','適格の,資格のある、（結婚相手として）望ましい','固有の,本質的な','勤勉な、入念な','職業の,職業訓練の（ための）','破産宣告を受けた、破綻している','厳しい、いかめしい','頑固な,強情な、手に負えない','母の,母親らしい、妊婦の','肥沃な、多産の','熟した、成熟した','硬直した,凝った、堅い','廃れた,使われなくなった、古くなった','空いている','音響の、聴覚の、（楽器が）アコースティックの','予備の,準備の','おおよその','暗黙の、内在する','時間を守る','矛盾しない、互換性のある、気が合う','十分すぎるほどの、広い','隅々に広がった、浸透する、充満する','至る所にある','を推測する,演繹する','を模擬実験する、を装う、をまねる','（を）合併する、を融合させる、溶け込む','（に）浸透する、（に）進出する、（を）貫く、（を）見抜く','（の）料理をまかなう、（要望などに）応える','に暴行する、を攻撃する','を拷問にかける、を苦しめる','出血する','を建てる、を直立させる','を大切にする、を心に抱く','（感情など）を引き起こす、を目覚めさせる','〔通例受身形で〕運命にある','（を）悼む、（を）嘆く','をひどく恐れる','に栄養を与える、をはぐくむ','（人）に注射する,を注入する、を導入する','（～を）ののしる（at）、（を）誓う','（～に）の値をつける（for ⇒ on）、（挨拶）を述べる','を堕落させる、を買収する、堕落する','の心を奪う,を夢中にさせる','（を）拾い読みする、（を）閲覧する、（商品など）を見て歩く','を編集する、（資料など）をまとめる','を割り当てる,分配する','を相殺する,埋め合わせる、をオフセット印刷にする','を制止する、を規制する','従う,応じる','期限が切れる','（～に）乗り出す（on）、乗船［搭乗］する','パタパタ動く、羽ばたく、をパタパタ動かす','に（～を）備えつける（with）','を偽造する、（関係など）を築く、を鍛造する','を押しつける、を突き刺す、押し進む','を派遣する、を発送する、を処理する','に憤慨する','を（～と）一致させる（with）、を和解させる','を主張する','を抑圧［迫害］する、を悩ませる','を追放する、を吐き出す','（を）上がる','始まる、を開始する、...し始める（to do / doing）⇒ commence work 仕事［作業］を始める','〔the ～〕出現,到来','治世、統治','外交（的手腕）','大使館、大使一行','亡命（者）、（国外）追放','避難（所）、保護','窮状、（悪い）状態','ひとりでいること、孤独','誤った考え,誤信、錯誤','緯度、（行動・思想などの）許容範囲','（日食・月食などの）食、（名声などの）失墜','流域、盆地,海盆、洗面器［台］','浸食、衰退','考古学','（人の）使い,使い走り、用件','慈悲、〔通例a ～〕幸運','修辞（法）、美辞麗句','韻文、詩','混雑','下水','（～の）補完物,補足（to）、（文法の）補語','補助金、報奨金','住宅ローン、抵当（権）','【米】 弁護士、代理人','衣装一式、装備［道具］一式、組織','〔the ～〕（～の）大半（of）、大きさ、大量','再会（の集い）、再結合','合成、総合','鋳型、鋳物、性格、かび','（のどの）渇き、（～に対する）渇望（for）','強欲','賄賂','軽蔑、恥辱','感触,手触り、本質、質感','孤児','嫌がらせ,ハラスメント','干し草','教義、【米】（政策上の）主義','全体論の、（医療が）ホリスティックの','しがちな、（～を）受けやすい（to）、責任がある','まじめな,熱心な','（簡単に）理解できる','突然の','無謀な、（～を）顧みない（of）','激怒した、猛烈な','雄弁な、説得力のある','青少年の','悪名高い','臆病な、内気な','湿気のある','感染（性）の、病気を伝染する','冷笑的な,皮肉な','ばかげた、口のきけない、無言の','単調な','永続的な、ひっきりなしの','目まいがする、当惑した','疲れ果てた、（～に）うんざりした（of）','麻痺した,無感覚な、ぼう然とした','致命的な、死すべき（運命の）','熱心な、熱狂的な'
]

const correct=
[
    'create','increase','improve','mean','own','include','consider','allow','suggest','produce','decide','offer','require','share','store','tend','concern','describe','involve','reduce','design','force','limit','bear','affect','deal','avoid','relate','realize','encourage','compare','measure','exist','mark','challenge','depend','object','demand','found','complete','idea','accord','company','interest','research','cause','reason','effect','influence','situation','environment','skill','matter','view','value','species','thought','knowledge','memory','practice','benefit','theory','issue','experiment','article','focus','subject','project','quality','role','term','statement','material','evidence','source','community','technology','culture','appropriate','likely','possible','individual','public','common','certain','similar','recent','major','patient','particular','physical','various','available','native','political','due','blank','ancient','correct','despite','notice','refer','approach','wonder','imagine','recognize','solve','occur','argue','claim','express','draw','waste','advance','spread','prepare','gain','achieve','establish','supply','suppose','perform','prefer','determine','treat','prove','apply','mention','communicate','contain','contact','regard','respect','search','connect','decline','prevent','suffer','survive','publish','opportunity','task','industry','medium','economy','policy','account','trade','model','figure','cell','image','emotion','stress','decade','range','character','advantage','phrase','damage','impact','method','resource','region','medicine','detail','feature','function','access','item','income','attitude','site','aspect','structure','habit','link','instance','positive','negative','complex','current','mental','specific','significant','essential','official','financial','academic','aware','worth','potential','active','digital','mobile','novel','plastic','chemical','necessary','eventually','identify','represent','indicate','manage','attend','maintain','survey','replace','sort','conduct','associate','attempt','promote','earn','unite','feed','seek','observe','reveal','estimate','reflect','attract','decrease','ignore','match','define','adapt','contribute','exchange','display','respond','hide','doubt','remove','wind','assume','relax','satisfy','desire','succeed','concept','fashion','device','charge','contrast','colleague','pain','bill','content','section','audience','surface','crop','topic','technique','status','option','reward','race','crime','conflict','struggle','context','debate','fuel','pollution','trend','balance','traffic','strategy','basis','consequence','aim','ancestor','gene','track','revolution','progress','cognitive','ideal','efficient','universal','vast','extra','entire','familiar','obvious','moral','ordinary','equal','previous','false','rare','legal','independent','extreme','actual','willing','urban','whereas','predict','examine','trust','stick','emerge','vary','release','divide','enable','judge','rely','engage','shift','adopt','acquire','expand','refuse','strike','repeat','consume','confuse','select','evolve','convince','recall','destroy','preserve','organize','warn','address','operate','participate','surround','flow','bore','complain','host','combine','extend','appreciate','target','element','principle','phenomenon','atmosphere','origin','personality','capacity','profit','circumstance','manner','threat','resident','wealth','institution','authority','vote','sight','campaign','fund','web','symbol','analysis','version','perspective','crisis','disaster','lecture','psychology','gender','custom','court','desert','soil','agriculture','fossil','document','vocabulary','intelligent','conscious','capable','accurate','fundamental','artificial','firm','overall','rural','military','nuclear','biological','constant','severe','visual','enormous','convenient','domestic','mass','typical','overseas','nevertheless','demonstrate','behave','educate','purchase','recommend','admit','generate','explore','amaze','tear','settle','afford','conclude','advertise','encounter','remind','locate','aid','bite','deliver','perceive','distinguish','imply','handle','praise','appeal','insist','compete','rank','deny','reject','intend','expose','favor','inspire','propose','spell','breathe','repair','consist','comment','instruction','religion','neighborhood','laboratory','presence','confidence','harm','instrument','category','capital','outcome','notion','review','trait','diversity','victim','occasion','facility','stock','conference','humanity','dialect','proportion','tip','lawyer','stuff','comfort','philosophy','mammal','quantity','landscape','tribe','organ','trial','norm','code','substance','multiple','numerous','narrow','widespread','sufficient','proper','linguistic','annual','contemporary','contrary','strict','civil','odd','unknown','superior','sensitive','violent','virtual','regardless','immediate','crucial','somewhat','interpret','translate','concentrate','request','criticize','overcome','obtain','inform','ensure','announce','grant','freeze','oppose','differ','hate','emphasize','employ','credit','transform','construct','arise','beat','regret','alter','absorb','disappoint','cure','transport','rush','hang','blame','ban','fascinate','recover','celebrate','manufacture','interact','arrange','adjust','confirm','insight','innovation','budget','fee','expense','debt','loan','duty','alarm','emergency','democracy','minister','fellow','candidate','corporation','stereotype','route','disorder','depression','weapon','immigration','barrier','disadvantage','mood','motion','routine','discipline','myth','hypothesis','physician','client','colony','statistics','grain','ingredient','treasure','contract','welfare','prime','curious','dramatic','distinct','anxious','vital','conventional','abstract','minor','extraordinary','stable','flexible','brief','aggressive','visible','unexpected','ethnic','alien','initial','exact','precise','latter','commit','stimulate','enhance','pursue','react','disagree','stare','abandon','quit','capture','transfer','bother','persuade','rent','breed','invest','reserve','trace','illustrate','advise','convey','attach','stretch','puzzle','disturb','crash','cope','permit','impress','suspect','upset','frighten','import','export','investigate','monitor','calculate','eliminate','ease','launch','sequence','therapy','symptom','incident','witness','sum','burden','tone','honor','award','priority','logic','minimum','exception','clue','bond','virus','surgery','insurance','frame','shelter','territory','boundary','habitat','district','conservation','harvest','predator','trap','trick','fault','discount','bias','cooperation','patent','dialogue','component','reputation','verbal','internal','solid','remote','principal','sophisticated','equivalent','rational','relevant','absolute','frequent','permanent','intense','meaningful','evil','extinct','random','raw','rude','mere','tropical','forth','possess','dominate','guarantee','melt','embarrass','discourage','detect','devote','urge','lend','restrict','isolate','accompany','exhaust','annoy','endanger','acknowledge','admire','evaluate','declare','secure','specialize','attribute','pretend','bury','reverse','resist','scare','imitate','assist','resemble','retire','neglect','collapse','reform','protest','owe','sustain','assign','accomplish','wisdom','literacy','heritage','mission','license','elite','layer','motor','protein','profession','editor','agent','globe','haven','row','sacrifice','means','session','league','contest','guard','opponent','glance','divorce','tissue','liquid','inequality','prejudice','justice','guideline','platform','sector','channel','glacier','primate','usage','fortune','correlation','artistic','literary','classic','liberal','concrete','slight','federal','primitive','unfamiliar','subtle','plain','marine','apparent','reluctant','temporary','guilty','royal','pure','incredible','eager','adequate','via','assess','approve','remark','pose','yield','exhibit','distribute','command','occupy','pop','pile','greet','apologize','frustrate','relieve','derive','deserve','peer','defeat','convert','wed','delight','boost','endure','correspond','impose','rescue','resolve','register','interrupt','rid','prohibit','compose','misunderstand','punish','ruin','defend','embrace','modify','qualify','passion','enthusiasm','phase','mode','span','gravity','orbit','asteroid','core','soul','nerve','infection','mall','grocery','humor','instinct','faith','courage','incentive','prospect','obstacle','architecture','stem','illusion','discrimination','shame','drought','flavor','portion','recipe','luxury','chip','ritual','sake','prefecture','council','administration','curriculum','precious','generous','casual','optimistic','rough','unpleasant','Arctic','ultimate','deaf','genuine','manual','mechanical','instant','spare','immune','harsh','collective','inevitable','profound','steady','mature','likewise','chase','sue','gaze','slip','load','overwhelm','wander','float','pour','substitute','pronounce','shrink','restore','trigger','grab','retain','reproduce','bob','entertain','interfere','cultivate','underlie','anticipate','justify','regulate','scan','classify','submit','pause','lean','bump','fold','hesitate','pump','mount','exceed','undergo','confront','consult','fulfill','privilege','formation','dimension','neuron','sensation','chart','geography','panel','semester','workforce','mill','abuse','vice','fate','tragedy','scenario','allergy','wound','antibiotic','vaccine','metaphor','folk','fare','transition','maximum','galaxy','mineral','skeleton','counterpart','stroke','pedestrian','trail','ecology','sibling','ratio','mixture','charm','ambition','prominent','radical','prompt','informal','mutual','neutral','alert','magnetic','polar','fluent','external','passive','awful','unrelated','cruel','fake','vulnerable','urgent','spiritual','modest','keen','nonetheless','negotiate','grasp','donate','arrest','crack','tap','split','forecast','exclude','overlook','burst','heal','forbid','install','diminish','cite','quote','dispute','highlight',
    'distract','cheat','foster','obey','bend','deprive','govern','log','transmit','bully','leap','astonish','thrill','nod','bow','blend','complicate','pitch','persist','dedicate','equip','premise','input','merit','sympathy','compliment','infrastructure','ray','distress','joint','expedition','adolescent','shade','jury','ethic','penalty','faculty','scheme','nutrition','particle','molecule','nationality','poll','clinic','dementia','fatigue','dilemma','queue','curve','narrative','fingerprint','file','wilderness','pesticide','panic','fabric','fantasy','fancy','virtue','grateful','valid','elaborate','moderate','dynamic','brave','brilliant','tremendous','oral','innocent','subsequent','shallow','indifferent','inferior','awkward','obese','pregnant','intimate','medieval','sacred','simultaneously','versus','proceed','orient','surf','filter','bind','resort','reinforce','accumulate','bet','advocate','constitute','undertake','grip','dismiss','fade','conceal','chew','swallow','seal','migrate','exaggerate','accuse','vanish','polish','wipe','sweep','mislead','spoil','compound','explode','disgust','commute','decorate','postpone','cease','compromise','elect','extract','inherit','rear','empathy','cue','enterprise','output','congress','millennium','mankind','Muslim','estate','landmine','caution','controversy','consensus','retail','fiber','scent','beverage','supplement','diabetes','province','reef','microbe','excess','gallery','fame','deadline','undergraduate','slavery','prey','mess','recession','retreat','grave','column','scenery','plot','sculpture','tablet','dense','exotic','acid','bitter','sensible','noble','vague','parallel','tense','vertical','indigenous','aboriginal','seasonal','abundant','hybrid','irrelevant','ridiculous','fairy','sensory','chronic','voluntary','inclined','infer','esteem','tackle','venture','accelerate','accustom','amuse','flourish','thrive','nurture','click','spin','clip','drag','cast','scatter','tempt','withdraw','yawn','blink','dye','spill','irritate','insult','enforce','rob','drain','suspend','drift','forgive','revise','recruit','twist','crush','pin','uncover','exploit','implement','integrate','incorporate','profile','appetite','impulse','script','anniversary','pension','temper','cortex','syndrome','chamber','utility','cattle','herd','fluid','pity','priest','acquaintance','offspring','famine','deforestation','jail','commodity','format','recipient','drill','inability','republic','combat','debris','bug','fraction','index','intuition','motive','consent','hierarchy','monument','asset','decent','competent','straightforward','cosmetic','delicate','interior','transparent','aesthetic','deliberate','demographic','prehistoric','innate','mild','toxic','ashamed','humble','peculiar','steep','trivial','magnificent','wireless','ongoing','assure','precede','revive','compel','blossom','terrify','violate','suppress','deceive','manipulate','starve','flee','whisper','yell','deposit','confine','swing','prolong','depict','outline','shed','emit','renew','utilize','assert','strain','strive','dare','boast','startle','offend','compute','assemble','worsen','flip','rub','descend','compensate','comprise','prevail','quest','dignity','criterion','paradox','parliament','legislation','agenda','mainstream','troop','epidemic','outbreak','chaos','nightmare','horror','cluster','pollen','hive','irrigation','dose','suicide','feast','cuisine','rumor','proverb','signature','formula','tuition','intake','spectrum','kidney','gear','aisle','grief','destiny','skull','tomb','monk','worship','outstanding','unprecedented','infinite','worthwhile','indispensable','compulsory','probable','ambiguous','obscure','skeptical','fragile','static','gradual','vocal','vivid','imperial','hostile','superficial','scarce','gross','inherent','notable','update','refresh','bloom','conquer','induce','attain','spray','retrieve','portray','scratch','designate','contradict','sigh','disrupt','depart','navigate','beg','inhabit','diagnose','comprehend','oblige','cram','flock','underestimate','clarify','spark','seize','soar','glow','disguise','distort','undermine','abolish','strip','dispose','dump','weave','refine','enrich','coordinate','headline','internship','outlet','remedy','pill','reception','transaction','mutation','dairy','compassion','posture','curse','funeral','census','encyclopedia','cereal','fragment','patch','rubbish','maze','outlook','breakthrough','triumph','ally','spectator','sphere','county','behalf','interval','circulation','blade','theft','vacuum','collision','bargain','landmark','revenue','treaty','supreme','thorough','naked','sincere','tame','insufficient','dim','acute','disabled','metropolitan','monetary','alternate','partial','divine','drastic','fierce','sole','spontaneous','spatial','neat','tidy','loyal','bless','regain','conform','enroll','entitle','halt','provoke','invade','squeeze','crawl','digest','utter','refrain','populate','accommodate','steer','drown','dip','soak','stir','transplant','reassure','resume','speculate','surpass','appoint','intrigue','decay','contaminate','swell','delete','tolerate','envy','pray','confess','resign','dissolve','unfold','awaken','conceive','entrepreneur','stake','surplus','inflation','sweatshop','clash','sociology','ideology','margin','realm','domain','algorithm','prairie','frontier','bullet','shield','despair','radiation','placebo','nursery','spouse','makeup','mummy','flesh','limb','odor','laundry','tide','questionnaire','nonsense','revenge','intellect','hospitality','librarian','manuscript','obsession','hygiene','paradigm','legitimate','authentic','empirical','immense','absurd','weird','accidental','uneasy','jealous','feminine','swift','hollow','crude','sore','pessimistic','vain','susceptible','edible','sheer','explicit','prone','affluent','collaborate','exert','excel','prosper','surge','intervene','insert','overtake','snap','carve','addict','condemn','convict','dictate','prescribe','inhibit','stray','roam','enclose','execute','coincide','lag','cling','erase','grind','knit','inquire','betray','leak','smash','bounce','sprawl','converse','recite','disregard','frown','evoke','pledge','aspire','contemplate','grace','enlightenment','commerce','draft','barrel','timber','garment','thread','cabinet','bureau','autonomy','toll','discourse','superstition','glimpse','arithmetic','glossary','archive','legacy','anthropology','rage','sorrow','psychiatrist','ward','stall','flame','moisture','irony','warrior','astronomy','probe','altitude','tumor','defect','sanitation','longevity','scope','sentiment','plausible','vigorous','masculine','rigid','adverse','coherent','literal','arbitrary','anonymous','antique','eternal','intermediate','subordinate','gloomy','thermal','faint','naive','apt','arrogant','extrovert','conspicuous','intact','embody','illuminate','console','verify','disclose','stack','rotate','constrain','hinder','withstand','tweet','sneeze','erupt','blur','overlap','embed','displace','render','plunge','surrender','plug','suck','mock','tease','soothe','stain','shun','stumble','flush','impair','presume','contend','roar','haunt','divert','await','fetch','unify','inspect','entail','tactics','feat','prestige','analogy','conscience','textile','deficit','plague','hazard','metabolism','paralysis','grid','carriage','friction','rebel','regime','monopoly','staple','merchandise','vendor','supervisor','predecessor','personnel','vessel','liver','duration','certificate','geometry','symmetry','biography','masterpiece','rhyme','premium','breakdown','courtesy','protocol','specimen','thesis','eligible','intrinsic','diligent','vocational','bankrupt','stern','stubborn','maternal','fertile','ripe','stiff','obsolete','vacant','acoustic','preliminary','approximate','implicit','punctual','compatible','ample','pervasive','ubiquitous','deduce','simulate','merge','penetrate','cater','assault','torture','bleed','erect','cherish','arouse','doom','mourn','dread','nourish','inject','swear','bid','corrupt','preoccupy','browse','compile','allocate','offset','restrain','comply','expire','embark','flap','furnish','forge','thrust','dispatch','resent','reconcile','allege','oppress','expel','ascend','commence','advent','reign','diplomacy','embassy','exile','refuge','plight','solitude','fallacy','latitude','eclipse','basin','erosion','archaeology','errand','mercy','rhetoric','verse','congestion','sewage','complement','subsidy','mortgage','attorney','outfit','bulk','reunion','synthesis','mold','thirst','greed','bribe','contempt','texture','orphan','harassment','hay','doctrine','holistic','liable','earnest','intelligible','abrupt','reckless','furious','eloquent','juvenile','notorious','timid','humid','contagious','cynical','dumb','monotonous','perpetual','dizzy','weary','numb','mortal','zealous'
];

let ox=[2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2];

let miss;
let miss_count=0;
const $result = document.getElementById('result');
const $question = document.getElementById('question');
const $question2 = document.getElementById('question2');

let quiz_count = 0;//今何問目かの判断をする変数
const $button = document.getElementsByTagName('button');//htmlのtype='button'の内容を入手

let button_length = $button.length;//一問当たりのボタン（選択肢の数）を保管する
let correct_score = 0;//正解数をカウントする

//リザルト画面で使う変数
let z=0;


//URLによって出題する内容を変える処理
let i;
if(/*location.href=="file:///Users/tatsuyatsuji/Downloads/%E4%BD%9C%E6%A5%AD%E3%83%95%E3%82%A1%E3%82%A4%E3%83%AB/WEB/English/section_19.html"||
*/location.href=="https://todorokitai.github.io/web/section1-1.html"){
    quiz_count = 0;
    let a = quiz_count;
    i=1;
    //const quiz_length = 50;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section1-2.html"){
    quiz_count = 50;
    let a = quiz_count;
    //const quiz_length = 50*2;
    i=2;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_1.html"){
    quiz_count = 0;
    let a = quiz_count;
    //const quiz_length = 50*2;
    i=2;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section2-1.html"){
    quiz_count = 0+50*2;
    let a = quiz_count;
    //const quiz_length = 50*3;
    i=3;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section2-2.html"){
    quiz_count = 0+50*3;
    let a = quiz_count;
    //const quiz_length 50*4;
    i=4;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_2.html"){
    quiz_count = 0+50*2;
    let a = quiz_count;
    //const quiz_length 50*4;
    i=4;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section3-1.html"){
    quiz_count = 0+50*4;
    let a = quiz_count;
    //const quiz_length 50*5;
    i=5;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section3-2.html"){
    quiz_count = 0+50*5;
    let a = quiz_count;
    //const quiz_length 50*6;
    i=6;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_3.html"){
    quiz_count = 0+50*4;
    let a = quiz_count;
    //const quiz_length 50*6;
    i=6;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section4-1.html"){
    quiz_count = 0+50*6;
    let a = quiz_count;
    //const quiz_length 50*7;
    i=7;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section4-2.html"){
    quiz_count = 0+50*7;
    let a = quiz_count;
    //const quiz_length 50*8;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_4.html"){
    quiz_count = 0+50*6;
    let a = quiz_count;
    //const quiz_length 50*8;
    i=8;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section5-1.html"){
    quiz_count = 0+50*8;
    let a = quiz_count;
    //const quiz_length 50*9;
    i=9;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section5-2.html"){
    quiz_count = 0+50*9;
    let a = quiz_count;
    //const quiz_length 50*10;
    i=10;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_5.html"){
    quiz_count = 0+50*8;
    let a = quiz_count;
    //const quiz_length 50*10;
    i=10;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section6-1.html"){
    quiz_count = 0+50*10;
    let a = quiz_count;
    //const quiz_length 50*11;
    i=11;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section6-2.html"){
    quiz_count = 0+50*11;
    let a = quiz_count;
    //const quiz_length 50*12;
    i=12;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_6.html"){
    quiz_count = 0+50*10;
    let a = quiz_count;
    //const quiz_length 50*12;
    i=12;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section7-1.html"){
    quiz_count = 0+50*12;
    let a = quiz_count;
    //const quiz_length 50*13;
    i=13;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section7-2.html"){
    quiz_count = 0+50*13;
    let a = quiz_count;
    //const quiz_length 50*14;
    i=14;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_7.html"){
    quiz_count = 0+50*12;
    let a = quiz_count;
    //const quiz_length 50*14;
    i=14;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section8-1.html"){
    quiz_count = 0+50*14;
    let a = quiz_count;
    //const quiz_length 50*15;
    i=15;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section8-2.html"){
    quiz_count = 0+50*15;
    let a = quiz_count;
    //const quiz_length 50*16;
    i=16;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_8.html"){
    quiz_count = 0+50*14;
    let a = quiz_count;
    //const quiz_length 50*16;
    i=16;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section9-1.html"){
    quiz_count = 0+50*16;
    let a = quiz_count;
    //const quiz_length 50*17;
    i=17;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section9-2.html"){
    quiz_count = 0+50*17;
    let a = quiz_count;
    //const quiz_length 50*18;
    i=18;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_9.html"){
    quiz_count = 0+50*16;
    let a = quiz_count;
    //const quiz_length 50*18;
    i=18;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section10-1.html"){
    quiz_count = 0+50*18;
    let a = quiz_count;
    //const quiz_length 50*19;
    i=19;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section10-2.html"){
    quiz_count = 0+50*19;
    let a = quiz_count;
    //const quiz_length 50*20;
    i=20;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_10.html"){
    quiz_count = 0+50*18;
    let a = quiz_count;
    //const quiz_length 50*20;
    i=20;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section11-1.html"){
    quiz_count = 0+50*20;
    let a = quiz_count;
    //const quiz_length 50*21;
    i=21;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section11-2.html"){
    quiz_count = 0+50*21;
    let a = quiz_count;
    //const quiz_length 50*22;
    i=22;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_11.html"){
    quiz_count = 0+50*20;
    let a = quiz_count;
    //const quiz_length 50*22;
    i=22;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section12-1.html"){
    quiz_count = 0+50*22;
    let a = quiz_count;
    //const quiz_length 50*23;
    i=23;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section12-2.html"){
    quiz_count = 0+50*23;
    let a = quiz_count;
    //const quiz_length 50*24;
    i=24;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_12.html"){
    quiz_count = 0+50*22;
    let a = quiz_count;
    //const quiz_length 50*24;
    i=24;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section13-1.html"){
    quiz_count = 0+50*24;
    let a = quiz_count;
    //const quiz_length 50*25;
    i=25;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section13-2.html"){
    quiz_count = 0+50*25;
    let a = quiz_count;
    //const quiz_length 50*26;
    i=26;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_13.html"){
    quiz_count = 0+50*24;
    let a = quiz_count;
    //const quiz_length 50*26;
    i=26;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section14-1.html"){
    quiz_count = 0+50*26;
    let a = quiz_count;
    //const quiz_length 50*27;
    i=27;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section14-2.html"){
    quiz_count = 0+50*27;
    let a = quiz_count;
    //const quiz_length 50*28;
    i=28;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_14.html"){
    quiz_count = 0+50*26;
    let a = quiz_count;
    //const quiz_length 50*28;
    i=28;
    z = a;
}
//
else if(location.href=="https://todorokitai.github.io/web/section15-1.html"){
    quiz_count = 0+50*28;
    let a = quiz_count;
    //const quiz_length 50*29;
    i=29;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section15-2.html"){
    quiz_count = 0+50*29;
    let a = quiz_count;
    //const quiz_length 50*30;
    i=29;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_15.html"){
    quiz_count = 0+50*28;
    let a = quiz_count;
    //const quiz_length 50*30;
    i=30;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section16-1.html"){
    quiz_count = 0+50*30;
    let a = quiz_count;
    //const quiz_length 50*31;
    i=31;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section16-2.html"){
    quiz_count = 0+50*31;
    let a = quiz_count;
    //const quiz_length 50*32;
    i=32;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_16.html"){
    quiz_count = 0+50*30;
    let a = quiz_count;
    //const quiz_length 50*32;
    i=32;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section17-1.html"){
    quiz_count = 0+50*32;
    let a = quiz_count;
    //const quiz_length 50*33;
    i=33;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section17-2.html"){
    quiz_count = 0+50*33;
    let a = quiz_count;
    //const quiz_length 50*34;
    i=34;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_17.html"){
    quiz_count = 0+50*32;
    let a = quiz_count;
    //const quiz_length 50*34;
    i=34;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section18-1.html"){
    quiz_count = 0+50*34;
    let a = quiz_count;
    //const quiz_length 50*35;
    i=35;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section18-2.html"){
    quiz_count = 0+50*35;
    let a = quiz_count;
    //const quiz_length 50*36;
    i=36;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_18.html"){
    quiz_count = 0+50*34;
    let a = quiz_count;
    //const quiz_length 50*36;
    i=36;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section19-1.html"){
    quiz_count = 0+50*36;
    let a = quiz_count;
    //const quiz_length 50*37;
    i=37;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section19-2.html"){
    quiz_count = 0+50*37;
    let a = quiz_count;
    //const quiz_length 50*38;
    i=38;
    z = a;
}
else if(location.href=="https://todorokitai.github.io/web/section_19.html"){
    quiz_count = 0+50*36;
    let a = quiz_count;
    //const quiz_length 50*38;
    i=38;
    z = a;
}

const quiz_length = 50*i;//クイズが合計何問あるのかを示す定数


//問題文と答えの選択肢を表示してくれるオブジェクト
const setup_quiz = ()=>{
    let button_count=0;
    document.getElementById('question').textContent = '第'+(quiz_count+1)+'問：「'+correct[quiz_count] + '」';//問題文表示
    document.getElementById('question2').textContent = '第'+(quiz_count+1)+'問：「'+correct[quiz_count] + '」';//問題文表示
    
    for(button_count=0;button_count<button_length;button_count++){
        if(button_count==button_length-3 ||button_count==button_length-6){
            $button[button_count].textContent = '分かった';//答え表示    
        }
        else if(button_count==(button_length-2) || button_count==(button_length-5)){//分からないの位置は固定
            $button[button_count].textContent = '分からない';
        }
        else if(button_count==(button_length-1) || button_count==(button_length-4)){
            $button[button_count].textContent = 'やめる';
        }
    }
};

setup_quiz();//実際にsetup_quizのオブジェクトを表示する

//正誤判定してくれるオブジェクト
const correctOrFalseAndUpdate = (e) =>{//この'e'はイベント関数という
    if('分かった' === e.target.textContent){
        var result = window.confirm('答えは「'+ question[quiz_count] + '」です。\n思っていたのと同じ意味なら「oK」を\n違っていたら「キャンセル」を押してください');
        if(result==false){//キャンセルを押した際の処理
            window.alert('disappointing');
            ox[quiz_count]='2';//不正解の意味
        }
        else{
            window.alert('great!');
            ox[quiz_count]='1';//正解の意味
        }
    }
    else if('分からない'===e.target.textContent){
        window.alert('答えは「'+ question[quiz_count] + '」です。');
        ox[quiz_count]='2';//不正解の意味
    }
    else if('やめる'===e.target.textContent){
        let i;
        for(let i=quiz_count;i<=quiz_length;i++){
            ox[quiz_count]='2';//不正解の意味
        }
        quiz_count=1901;
    }


    quiz_count++;//次の問題へ行くためのカウント
    if(quiz_count<quiz_length){//問題がこの後まだある時の処理
        setup_quiz();//
    }
    else{//問題がこの後もうない時の処理
        lastScreen();
    }
};
let index2 = 0;
for(index2=0;index2<button_length;index2++){
    document.getElementsByTagName('button')[index2].addEventListener('click', (e)=> {
        correctOrFalseAndUpdate(e);
    });
}

let count_z=0;
const lastScreen = ()=>{
    document.writeln('・間違えた単語たち<br><br>');
    while(z<quiz_length){
        if(ox[z]=='2'){
            document.writeln(''+ correct[z] +'（'+ question[z] + '）<br>(' + (z+1) + '番目)'+ '<br><br>');
            count_z++;
            
        }
        z++;
    }

    if(count_z==0){
        //document.getElementById('question').textContent = '全問正解です。おめでとう！！！';//満点の時の表示
        document.writeln('全問正解です。おめでとう！！！');
    }
};


